# Data Incompleteness

In [4]:
#HOW TO DETECT MISSING DATA

#FIRST INSPECT YOUR DATA
import pandas as pd 
data = pd.read_csv("glass.csv")

In [5]:
data.sample(10)

          RI     Na    Mg    Al     Si     K     Ca    Ba    Fe  Type
91   1.51605  12.90  3.44  1.45  73.06  0.44   8.27  0.00  0.00     2
70   1.51574  14.86  3.67  1.74  71.87  0.16   7.36  0.00  0.12     2
151  1.52127  14.32  3.90  0.83  71.50  0.00   9.49  0.00  0.00     3
110  1.52664  11.23  0.00  0.77  73.21  0.00  14.68  0.00  0.00     2
118  1.51673  13.30  3.64  1.53  72.53  0.65   8.03  0.00  0.29     2
81   1.51593  13.25  3.45  1.43  73.17  0.61   7.86  0.00  0.00     2
202  1.51514  14.85  0.00  2.42  73.72  0.00   8.39  0.56  0.00     7
40   1.51793  12.79  3.50  1.12  73.03  0.64   8.77  0.00  0.00     1
88   1.51618  13.01  3.50  1.48  72.89  0.60   8.12  0.00  0.00     2
127  1.52081  13.78  2.28  1.43  71.99  0.49   9.85  0.00  0.17     2

In [6]:
print(data.shape)
print(type(data))

(214, 10)
<class 'pandas.core.frame.DataFrame'>

In [7]:
data.columns

Index(['RI', 'Na', 'Mg', 'Al', 'Si', 'K', 'Ca', 'Ba', 'Fe', 'Type'], dtype='object')

In [8]:
data.index

RangeIndex(start=0, stop=214, step=1)

##  Duplicate values

In [9]:
help(pd.DataFrame.duplicated)

Help on function duplicated in module pandas.core.frame:

duplicated(self, subset: Union[Hashable, Sequence[Hashable], NoneType] = None, keep: Union[str, bool] = 'first') -> 'Series'
    Return boolean Series denoting duplicate rows.

    Considering certain columns is optional.

    Parameters
    ----------
    subset : column label or sequence of labels, optional
        Only consider certain columns for identifying duplicates, by
        default use all of the columns.
    keep : {'first', 'last', False}, default 'first'
        Determines which duplicates (if any) to mark.

        - ``first`` : Mark duplicates as ``True`` except for the first occurrence.
        - ``last`` : Mark duplicates as ``True`` except for the last occurrence.
        - False : Mark all duplicates as ``True``.

    Returns
    -------
    Series

In [6]:
data.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
209    False
210    False
211    False
212    False
213    False
Length: 214, dtype: bool

In [7]:
data[data.duplicated()]

         RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Type
39  1.52213  14.21  3.82  0.47  71.77  0.11  9.57  0.0  0.0     1

In [ ]:
help(pd.DataFrame.drop_duplicates)

In [8]:
data.drop_duplicates(inplace=True)
print(data.shape)

(213, 10)

## Missing Values

In [9]:
data.groupby('Type').mean()        Determines

,RI,Na,Mg,Al,Si,K,Ca,Ba,Fe
Type,,,,,,,,,
1,1.518669,13.228261,3.548551,1.173913,72.631449,0.452319,8.786087,0.012899,0.057826
2,1.518619,13.111711,3.002105,1.408158,72.598026,0.521053,9.073684,0.050263,0.079737
3,1.517964,13.437059,3.543529,1.201176,72.404706,0.406471,8.782941,0.008824,0.057059
5,1.518928,12.827692,0.773846,2.033846,72.366154,1.470000,10.123846,0.187692,0.060769
6,1.517456,14.646667,1.305556,1.366667,73.206667,0.000000,9.356667,0.000000,0.000000
7,1.517116,14.442069,0.538276,2.122759,72.965862,0.325172,8.491379,1.040000,0.013448

In [11]:
#Create some missing values
import numpy as np
data.iloc[::3,-1]=np.nan #not a number (to every third element)
data.iloc[::4,0]=np.nan

In [12]:
data.head(10)

        RI     Na    Mg    Al     Si     K    Ca   Ba    Fe  Type
0      NaN  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.00   NaN
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.00   1.0
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.00   1.0
3  1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.0  0.00   NaN
4      NaN  13.27  3.62  1.24  73.08  0.55  8.07  0.0  0.00   1.0
5  1.51596  12.79  3.61  1.62  72.97  0.64  8.07  0.0  0.26   1.0
6  1.51743  13.30  3.60  1.14  73.09  0.58  8.17  0.0  0.00   NaN
7  1.51756  13.15  3.61  1.05  73.24  0.57  8.24  0.0  0.00   1.0
8      NaN  14.04  3.58  1.37  72.08  0.56  8.30  0.0  0.00   1.0
9  1.51755  13.00  3.60  1.36  72.99  0.57  8.40  0.0  0.11   NaN

In [13]:
#To make detecting missing values easier (and across different array dtypes), 
#pandas provides the isna() and notna() functions, 
#which are also methods on Series and DataFrame objects

type(data['Type'])

pandas.core.series.Series

In [14]:
data.isna().any()

RI       True
Na      False
Mg      False
Al      False
Si      False
K       False
Ca      False
Ba      False
Fe      False
Type     True
dtype: bool

In [13]:
#or you can ask for who is notNAN
data['Type'].notna()

0      False
1       True
2       True
3      False
4       True
       ...
209     True
210     True
211    False
212     True
213     True
Name: Type, Length: 213, dtype: bool

In [15]:
data.isna().head() #on the entire dataframe

      RI     Na     Mg     Al     Si      K     Ca     Ba     Fe   Type
0   True  False  False  False  False  False  False  False  False   True
1  False  False  False  False  False  False  False  False  False  False
2  False  False  False  False  False  False  False  False  False  False
3  False  False  False  False  False  False  False  False  False   True
4   True  False  False  False  False  False  False  False  False  False

In [16]:
#a few comments:
##When summing data, NA (missing) values will be treated as zero.
##NA groups in GroupBy are automatically excluded

data.groupby("Type").mean()

#In other words, there will never be an “NA group” 
#This was not the case in older versions of pandas

,RI,Na,Mg,Al,Si,K,Ca,Ba,Fe
Type,,,,,,,,,
1.0,1.518676,13.193261,3.546304,1.185652,72.632609,0.459348,8.80413,0.001957,0.06087
2.0,1.518681,13.103000,3.012600,1.423200,72.612600,0.530400,9.08100,0.010000,0.07320
3.0,1.517674,13.387500,3.507500,1.231667,72.511667,0.422500,8.66250,0.012500,0.07250
5.0,1.518822,12.810000,0.667500,1.886250,72.538750,1.255000,10.57500,0.030000,0.06375
6.0,1.517882,14.165000,1.455000,1.433333,73.095000,0.000000,9.72500,0.000000,0.00000
7.0,1.516903,14.467000,0.524500,2.125500,72.912500,0.432000,8.35450,1.109000,0.01500

In [16]:
data.groupby("Type").min()

           RI     Na    Mg    Al     Si     K    Ca   Ba   Fe
Type
1.0   1.51215  12.56  2.81  0.47  71.35  0.00  7.78  0.0  0.0
2.0   1.51409  11.02  0.00  0.75  70.16  0.00  7.08  0.0  0.0
3.0   1.51610  12.16  3.36  0.65  71.36  0.06  8.32  0.0  0.0
5.0   1.51316  11.56  0.00  1.40  70.48  0.32  6.96  0.0  0.0
6.0   1.51299  13.79  0.00  0.56  72.37  0.00  7.59  0.0  0.0
7.0   1.51508  11.95  0.00  1.19  70.26  0.00  5.43  0.0  0.0

In [ ]:
data

## Some alternatives to deal with missing values

## 1. Drop

In [24]:
#How to use "dropna" method to Remove missing values from a dataframe.

data = pd.read_csv("glass.csv")
data.iloc[::3,-1]=np.nan #not a number (to every third element)

data
#Drop the rows where at least one element is missing.
#data_drop=data.dropna(axis=1) #1/3 has been removed
#data_drop
print(len(data), len(data_drop))
    
#Drop the columns where at least one element is missing.
#data_drop=data.dropna(axis=1) # or axis=1 #remove the  column
#data_drop

#Drop the rows where all elements are missing.
#data_drop=data.dropna(how='all')
#data_drop
#Define in which columns to look for missing values.
data.dropna(subset=['RI','Type'])

#Keep the DataFrame with valid entries in the same variable
#that means that dropna changed data
#data.dropna(inplace=True)

#print out your data

#print(data.shape)
#print(data.head())

#print(data_drop.shape)
#print(data_drop.head())

214 214

          RI     Na    Mg    Al     Si     K    Ca    Ba    Fe  Type
1    1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.00  0.00   1.0
2    1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.00  0.00   1.0
4    1.51742  13.27  3.62  1.24  73.08  0.55  8.07  0.00  0.00   1.0
5    1.51596  12.79  3.61  1.62  72.97  0.64  8.07  0.00  0.26   1.0
7    1.51756  13.15  3.61  1.05  73.24  0.57  8.24  0.00  0.00   1.0
..       ...    ...   ...   ...    ...   ...   ...   ...   ...   ...
206  1.51645  14.94  0.00  1.87  73.11  0.00  8.67  1.38  0.00   7.0
208  1.51640  14.37  0.00  2.74  72.85  0.00  9.45  0.54  0.00   7.0
209  1.51623  14.14  0.00  2.88  72.61  0.08  9.18  1.06  0.00   7.0
211  1.52065  14.36  0.00  2.02  73.42  0.00  8.44  1.64  0.00   7.0
212  1.51651  14.38  0.00  1.94  73.61  0.00  8.48  1.57  0.00   7.0

[142 rows x 10 columns]

### 2. SUBSTITUTION:  (Be careful using this approach!)

How to use "fillna" to replace missing values

In [27]:

data = pd.read_csv("glass.csv")
data.iloc[::3,-1]=np.nan 

data
data.fillna(0)

          RI     Na    Mg    Al     Si     K    Ca    Ba   Fe  Type
0    1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.00  0.0   0.0
1    1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.00  0.0   1.0
2    1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.00  0.0   1.0
3    1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.00  0.0   0.0
4    1.51742  13.27  3.62  1.24  73.08  0.55  8.07  0.00  0.0   1.0
..       ...    ...   ...   ...    ...   ...   ...   ...  ...   ...
209  1.51623  14.14  0.00  2.88  72.61  0.08  9.18  1.06  0.0   7.0
210  1.51685  14.92  0.00  1.99  73.06  0.00  8.40  1.59  0.0   0.0
211  1.52065  14.36  0.00  2.02  73.42  0.00  8.44  1.64  0.0   7.0
212  1.51651  14.38  0.00  1.94  73.61  0.00  8.48  1.57  0.0   7.0
213  1.51711  14.23  0.00  2.08  73.36  0.00  8.62  1.67  0.0   0.0

[214 rows x 10 columns]

In [28]:
#if I want to replace with different rules in different columns
data.iloc[::4,0]=np.nan #not a number (to every forth element)
data

          RI     Na    Mg    Al     Si     K    Ca    Ba   Fe  Type
0        NaN  13.64  4.49  1.10  71.78  0.06  8.75  0.00  0.0   NaN
1    1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.00  0.0   1.0
2    1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.00  0.0   1.0
3    1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.00  0.0   NaN
4        NaN  13.27  3.62  1.24  73.08  0.55  8.07  0.00  0.0   1.0
..       ...    ...   ...   ...    ...   ...   ...   ...  ...   ...
209  1.51623  14.14  0.00  2.88  72.61  0.08  9.18  1.06  0.0   7.0
210  1.51685  14.92  0.00  1.99  73.06  0.00  8.40  1.59  0.0   NaN
211  1.52065  14.36  0.00  2.02  73.42  0.00  8.44  1.64  0.0   7.0
212      NaN  14.38  0.00  1.94  73.61  0.00  8.48  1.57  0.0   7.0
213  1.51711  14.23  0.00  2.08  73.36  0.00  8.62  1.67  0.0   NaN

[214 rows x 10 columns]

In [ ]:
values = {'Type': 33} #you can add more rules here for the other columns
data.fillna(value=values).head()

In [30]:
values = {'Type': 0, "RI": -1} #you can add more rules here for the other columns
data.fillna(value=values)

          RI     Na    Mg    Al     Si     K    Ca    Ba   Fe  Type
0   -1.00000  13.64  4.49  1.10  71.78  0.06  8.75  0.00  0.0   0.0
1    1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.00  0.0   1.0
2    1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.00  0.0   1.0
3    1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.00  0.0   0.0
4   -1.00000  13.27  3.62  1.24  73.08  0.55  8.07  0.00  0.0   1.0
..       ...    ...   ...   ...    ...   ...   ...   ...  ...   ...
209  1.51623  14.14  0.00  2.88  72.61  0.08  9.18  1.06  0.0   7.0
210  1.51685  14.92  0.00  1.99  73.06  0.00  8.40  1.59  0.0   0.0
211  1.52065  14.36  0.00  2.02  73.42  0.00  8.44  1.64  0.0   7.0
212 -1.00000  14.38  0.00  1.94  73.61  0.00  8.48  1.57  0.0   7.0
213  1.51711  14.23  0.00  2.08  73.36  0.00  8.62  1.67  0.0   0.0

[214 rows x 10 columns]

In [32]:
data.fillna(data.mean()[["Type"]])#replace missing value with the column mean

          RI     Na    Mg    Al     Si     K    Ca    Ba   Fe     Type
0        NaN  13.64  4.49  1.10  71.78  0.06  8.75  0.00  0.0  2.78169
1    1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.00  0.0  1.00000
2    1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.00  0.0  1.00000
3    1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.00  0.0  2.78169
4        NaN  13.27  3.62  1.24  73.08  0.55  8.07  0.00  0.0  1.00000
..       ...    ...   ...   ...    ...   ...   ...   ...  ...      ...
209  1.51623  14.14  0.00  2.88  72.61  0.08  9.18  1.06  0.0  7.00000
210  1.51685  14.92  0.00  1.99  73.06  0.00  8.40  1.59  0.0  2.78169
211  1.52065  14.36  0.00  2.02  73.42  0.00  8.44  1.64  0.0  7.00000
212      NaN  14.38  0.00  1.94  73.61  0.00  8.48  1.57  0.0  7.00000
213  1.51711  14.23  0.00  2.08  73.36  0.00  8.62  1.67  0.0  2.78169

[214 rows x 10 columns]

In [33]:
#data.head()
data.fillna(data.mean()["RI":"Type"]).head()

         RI     Na    Mg    Al     Si     K    Ca   Ba   Fe     Type
0  1.518542  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0  2.78169
1  1.517610  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0  1.00000
2  1.516180  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0  1.00000
3  1.517660  13.21  3.69  1.29  72.61  0.57  8.22  0.0  0.0  2.78169
4  1.518542  13.27  3.62  1.24  73.08  0.55  8.07  0.0  0.0  1.00000